import os
from dotenv import load_dotenv

"""config file for constants and environment variables"""

load_dotenv()

SERVICE_ACCOUNT_FILE = os.getenv("SERVICE_ACCOUNT_FILE")
FOLDER_ID = os.getenv("FOLDER_ID")
EXCEL_PATH = os.getenv("EXCEL_PATH")

TOP_WORKS = [
    "Компʼютерна діагностика",
    "Заміна оливи ДВ3 + масляний фільтр",
    "Комплексна діагностика",
    "Ендоскопія",
    "Заміна повітряного фільтра ДВЗ",
    "Заміна фільтра салону в салонному відділенні",
    "Заміна сайлентблоку",
    "Зняття / встановлення важіля",
    "Заміна еластичной муфти карданного валу",
    "Слюсарні роботи",
    "Зняття / встановлення важіля прд.",
    "Заміна амортизатора переднього",
    "Заміна оливи АКПП",
    "Мийка / чистка деталі",
    "Зняття / встановлення повітряного патрубка",
    "Заміна охолоджувальної рідини",
    "Заміна гальмівної рідини з прокачкою",
    "Заміна оливи в зд. редукторі",
    "Кодування опцій"
]
